Feature: Регистриране за класиране

  Background:
    Given Родителя отваря екрана за регистриране

  Scenario: Вход в системата с валидни данни
    When Въведе име и фамилия: "Иван Иванов"
    And въвежда дали детето има увреждане: "true"
    And въвежда ЕГН: "0047026027"
    And въвежда дали детето е близнак: "true"
    And въвежда колко работещи родители има детето: "2"
    And въвежда дали детето има брат или сестра в заведението: "true"
    And натиска бутон за вписване
    Then Вижда съобщение: "Детето Ви е регистрирано!"

  Scenario: Вход в системата със сгрешено име
    When Въведе име и фамилия: "Иван"
    And въвежда дали детето има увреждане: "true"
    And въвежда ЕГН: "0047026027"
    And въвежда дали детето е близнак: "true"
    And въвежда колко работещи родители има детето: "2"
    And въвежда дали детето има брат или сестра в заведението: "true"
    And натиска бутон за вписване
    Then Вижда съобщение: "Въведете нормално име..."

  Scenario: Вход в системата с невалидно ЕГН
    When Въведе име и фамилия: "Иван Иванов"
    And въвежда дали детето има увреждане: "true"
    And въвежда ЕГН: "ОО47О26О27"
    And въвежда дали детето е близнак: "true"
    And въвежда колко работещи родители има детето: "2"
    And въвежда дали детето има брат или сестра в заведението: "true"
    And натиска бутон за вписване
    Then Вижда съобщение: "ЕГН тр. да съдържа точно 10 цифри и нищо друго бе неандърталиц!"

  Scenario: Въвежда по интересен начин тру и фолс като пълен кретен
    When Въведе име и фамилия: "Иван Иванов"
    And въвежда дали детето има увреждане: "tru"
    And въвежда ЕГН: "0047026027"
    And въвежда дали детето е близнак: "fols"
    And въвежда колко работещи родители има детето: "2"
    And въвежда дали детето има брат или сестра в заведението: "yesbaby"
    And натиска бутон за вписване
    Then Вижда съобщение: "Използвайте [true] & [false] за да записвате стойностите с да и не."

  Scenario: Въвежда невалиден брой работещи родители
    When Въведе име и фамилия: "Иван Иванов"
    And въвежда дали детето има увреждане: "tru"
    And въвежда ЕГН: "0047026027"
    And въвежда дали детето е близнак: "fols"
    And въвежда колко работещи родители има детето: "X"
    And въвежда дали детето има брат или сестра в заведението: "yesbaby"
    And натиска бутон за вписване
    Then Вижда съобщение: "Въведете правилно брой работещи родители [0, 1, 2]."